In [3]:
print("hello")
print(2+3)

hello
5

In [4]:
print('jjhh')

jjhh

In [2]:
import pandas as pd
import numpy as np

In [7]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : e8093ba372f9adfe79439d90fe74b0b5b6dea9d6
python           : 3.10.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19042
machine          : AMD64
processor        : Intel64 Family 6 Model 61 Stepping 4, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.3
numpy            : 1.23.1
pytz             : 2022.1
dateutil         : 2.8.2
setuptools       : 58.1.0
pip              : 22.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : None
IPython          : 8.4.0
pandas_datareader: None
bs4              : None
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : None
matplotlib       : 3.5.2
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.8.1
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

In [8]:
df=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [9]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.316405,0.228729,0.705946,0.477816,0.548720,0.294994,0.912767,0.189191
1,0.178655,0.496430,0.128959,0.934877,0.631017,0.351820,0.419196,0.578521
2,0.920026,0.055960,0.475325,0.327258,0.317647,0.678657,0.354380,0.391710
3,0.493444,0.355682,0.998753,0.284752,0.783022,0.404662,0.640246,0.096953

In [10]:
pd.DataFrame(np.random.rand(4,8),columns = list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,0.684192,0.481884,0.794030,0.229675,0.443258,0.674066,0.244640,0.698899
1,0.029251,0.015479,0.142964,0.851678,0.839149,0.713498,0.762652,0.780035
2,0.727329,0.535769,0.878820,0.318114,0.100939,0.732091,0.691437,0.603031
3,0.681271,0.322937,0.142608,0.640649,0.913581,0.168439,0.791624,0.784725

In [12]:
pd.DataFrame(np.random.rand(2,4),columns = list('ABCD'))

          A        B         C         D
0  0.031214  0.38353  0.602408  0.265454
1  0.649878  0.04996  0.119380  0.668800

In [8]:
for x in range(1,10):
    print('Python ka chilla')

for x in range(1,10):
    if x > 2:
        print(x)
    else:
        print("x is less than 2")

Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
Python ka chilla
x is less than 2
x is less than 2
3
4
5
6
7
8
9

In [9]:
def sum(x,y):
    return(x+y)

sum(2,3)

5

In [12]:
print(sum(6,9))

15

In [18]:
df = pd.DataFrame(np.random.rand(2,4),columns = list('ABCD'))
df

          A         B         C         D
0  0.147881  0.000638  0.181575  0.491018
1  0.118329  0.117311  0.975975  0.272339

In [20]:
df.columns=('A1','B2','C3','D4')
df.head(1)

         A1        B2        C3        D4
0  0.147881  0.000638  0.181575  0.491018

In [23]:
df=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8],'C':["hello","amigo","python","chilla"]})
df

   A  B       C
0  1  5   hello
1  2  6   amigo
2  3  7  python
3  4  8  chilla

In [25]:
df=pd.DataFrame({"Fruit":['Mango','Orange','Lychee','Apple'],"Price/kg":[100,80,200,150]})
df

    Fruit  Price/kg
0   Mango       100
1  Orange        80
2  Lychee       200
3   Apple       150

In [3]:
df = pd.DataFrame({"NAME":['Owais','Daniyal','Mohsin','Fasih','Sohaib'],"Order":['Burger','Steak','Fries','Pizza','Cake'],"Amount":[350,500,250,320,200]})
df

      NAME   Order  Amount
0    Owais  Burger     350
1  Daniyal   Steak     500
2   Mohsin   Fries     250
3    Fasih   Pizza     320
4   Sohaib    Cake     200

In [7]:
df.head(3)

      NAME   Order  Amount
0    Owais  Burger     350
1  Daniyal   Steak     500
2   Mohsin   Fries     250

In [31]:
display(df.iloc[1])

NAME      Daniyal
Order       Steak
Amount        500
Name: 1, dtype: object

In [32]:
df

      NAME   Order  Amount
0    Owais  Burger     350
1  Daniyal   Steak     500
2   Mohsin   Fries     250
3    Fasih   Pizza     320
4   Sohaib    Cake     200

In [34]:
#adding prefix
df1=df.add_prefix("SID-")
df1

  SID-NAME SID-Order  SID-Amount
0    Owais    Burger         350
1  Daniyal     Steak         500
2   Mohsin     Fries         250
3    Fasih     Pizza         320
4   Sohaib      Cake         200

In [35]:
#4-using template data

In [36]:
import pandas as pd
import numpy as np
import seaborn as sns

Matplotlib is building the font cache; this may take a moment.

In [37]:
ship = sns.load_dataset('titanic')

In [38]:
ship.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [41]:
#summary
ship.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [46]:
#column names
ship.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [47]:
#saving a dataset
ship.to_csv('titanic.csv')

In [52]:
ship.to_excel('titanic_1.xlsx')
#ship.head(2)

In [54]:
# 5 -using your own data
fruit=pd.read_excel('Fruit.xlsx')
fruit.head(2)

   Sr.No  Fruit  Price/kg Amount Month
0    1.0  Mango     120.0   6800   MAY
1    2.0  Mango     200.0   7200  JUNE

In [55]:
# - Reverse rown order
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
df.loc[::-1].head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False

In [58]:
list = [1,2,3,4,5,6,7,8,9,10]
list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [59]:
list[::-1]

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [63]:
list[2:8:1]
list[0:8:2]

[1, 3, 5, 7]

In [67]:
df.loc[::-1].reset_index(drop = True).head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False

In [69]:
#7- Reverse column order
df.loc[:,::-1].head(3)

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1

In [70]:
#8-Select a column by data-type
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [75]:
#only select those having numeric types
df.select_dtypes(include=['number']).head(3)

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250

In [76]:
df.select_dtypes(include=['object']).head(2)

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes

In [77]:
df.select_dtypes(include =['number','bool']).head(3)

   survived  pclass   age  sibsp  parch     fare  adult_male  alone
0         0       3  22.0      1      0   7.2500        True  False
1         1       1  38.0      1      0  71.2833       False  False
2         1       3  26.0      0      0   7.9250       False   True

In [83]:
df.select_dtypes(exclude=['bool']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no

In [84]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"A":[1,2,3],"B":['4','5','6']})
df.head()

   A  B
0  1  4
1  2  5
2  3  6

In [86]:
df.dtypes

A     int64
B    object
dtype: object

In [97]:
df_1 = df.astype({'A':'int64','B':'int64'})
df
print(df.dtypes)
print(df_1.dtypes)

A     int64
B    object
dtype: object
A    int64
B    int64
dtype: object

In [101]:

df_2 = pd.to_numeric(df['B'],errors='coerce')
df_2.dtypes

dtype('int64')

In [106]:
print("1st one is:",df.dtypes,"second one is:", df_1.dtypes,"and the third one is:",df_2.dtypes)

1st one is: A     int64
B    object
dtype: object second one is: A    int64
B    int64
dtype: object and the third one is: int64

In [109]:
print(df_2)
display(df_2.iloc[1])

0    4
1    5
2    6
Name: B, dtype: int64

5

In [110]:
df_2

0    4
1    5
2    6
Name: B, dtype: int64

In [111]:
df_1

   A  B
0  1  4
1  2  5
2  3  6

In [112]:
display(df_1.iloc[1])

A    2
B    5
Name: 1, dtype: int64

In [113]:
# 10-Reduce Data Frame size
kashti = sns.load_dataset("titanic")
kashti.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [115]:
kashti.shape
kashti.info

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [124]:
kashti.sample(frac = 0.1).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
310,1,1,female,24.0,0,0,83.1583,C,First,woman,False,C,Cherbourg,yes,True
699,0,3,male,42.0,0,0,7.6500,S,Third,man,True,F,Southampton,no,True
488,0,3,male,30.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
320,0,3,male,22.0,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
295,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True

In [123]:
# 11 -Copy data from clipboard

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [125]:
df=pd.read_clipboard()
df

   Fruit  Price/kg  Amount      Month
0  Mango     120.0   6,800        MAY
1  Mango     200.0   7,200       JUNE
2  Mango     220.0   8,900       JULY
3  Mango     240.0  10,000     AUGUST
4  Mango     260.0   6,500  SEPTEMBER
5  Mango       NaN       0    OCTOBER
6  Mango       NaN       0   NOVEMBER

In [126]:
# 12 -Split data frame in to two subsets
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [128]:
print(len(df))
print(df.shape)

150
(150, 5)

In [129]:
phool = df.sample(frac = 0.50, random_state =1)
phool.shape

(75, 5)

In [130]:
phool_2 = df.drop(phool.index)
phool_2.shape

(75, 5)

In [131]:
phool_2.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa

In [132]:
phool.head()

     sepal_length  sepal_width  petal_length  petal_width     species
14            5.8          4.0           1.2          0.2      setosa
98            5.1          2.5           3.0          1.1  versicolor
75            6.6          3.0           4.4          1.4  versicolor
16            5.4          3.9           1.3          0.4      setosa
131           7.9          3.8           6.4          2.0   virginica

In [134]:
df = pd.read_excel("Fruit.xlsx")
df.head()

   Sr.No  Fruit  Price/kg Amount      Month
0    1.0  Mango     120.0   6800        MAY
1    2.0  Mango     200.0   7200       JUNE
2    3.0  Mango     220.0   8900       JULY
3    4.0  Mango     240.0  10000     AUGUST
4    5.0  Mango     260.0   6500  SEPTEMBER

In [136]:
df.to_csv("Fruito.csv")

In [137]:
import csv

In [138]:
data = pd.read_csv("fruito.csv")
data.head()

   Unnamed: 0  Sr.No  Fruit  Price/kg Amount      Month
0           0    1.0  Mango     120.0   6800        MAY
1           1    2.0  Mango     200.0   7200       JUNE
2           2    3.0  Mango     220.0   8900       JULY
3           3    4.0  Mango     240.0  10000     AUGUST
4           4    5.0  Mango     260.0   6500  SEPTEMBER

In [140]:
#data_lines = list(data)
data[:3]

   Unnamed: 0  Sr.No  Fruit  Price/kg Amount Month
0           0    1.0  Mango     120.0   6800   MAY
1           1    2.0  Mango     200.0   7200  JUNE
2           2    3.0  Mango     220.0   8900  JULY

In [155]:
print(df.Fruit[2]+" "+df.Month[2])

Mango JULY